yesand/app/controllers/auth_controller.rb

  def login
    @user = User.find_by(username: params[:user][:username])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT 1  [["username", "hello"]]