yesand/app/controllers/ideas_controller.rb

INSERT INTO "ideas" ("title", "description", "creator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "adfsafdsfdsa"], ["description", "adsfafdsfdsadsaf"], ["creator_id", 1], ["created_at", "2015-03-18 22:35:44.389084"], ["updated_at", "2015-03-18 22:35:44.389084"]]
---
  def create
    current_user.ideas.create(idea_params)

SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = $1 LIMIT 1  [["id", 2]]
---
  def show
    @idea = Idea.find_by(id: params[:id]) ## Write helper once views are integrated and we can test